import openpyxl
import pandas as pd

import os
a=0 #0-64 open_house
b=2 #1-7
c=1 #1-10
d=1 #1-3

file_list = os.listdir('Z:/share/대용량/2. 2020년 AI기반 스마트하우징 기술개발 사업 (국토교통부)/3차년도/개발자료/FDS data/시나리오 데이터/H' + str(b) + '/R' + str(c).zfill(2) + '/P' + str(d).zfill(3))
print(file_list)

open_house = ['D0000000', 'D1000000', 'D1100000', 'D1010000', 'D1001000', 'D1000100', 'D1000010', 'D1000001', 'D1110000', 'D1101000', 'D1100100', 'D1100010', 'D1100001', 'D1011000', 'D1010100', 'D1010010', 'D1010001', 'D1001100', 'D1001010', 'D1001001', 'D1000110', 'D1000101', 'D1000011', 'D1111000', 'D1110100', 'D1110010', 'D1110001', 'D1101100', 'D1101010', 'D1101001', 'D1100110', 'D1100101', 'D1100011', 'D1011100', 'D1011010', 'D1011001', 'D1010110', 'D1010101', 'D1010011', 'D1001110', 'D1001101', 'D1001011', 'D1000111', 'D1111100', 'D1111010', 'D1111001', 'D1110110', 'D1110101', 'D1110011', 'D1101110', 'D1101101', 'D1101011', 'D1100111', 'D1011110', 'D1011101', 'D1011011', 'D1010111', 'D1001111', 'D1111110', 'D1111101', 'D1111011', 'D1110111', 'D1101111', 'D1011111', 'D1111111']


num = 1951
listex = [0, 5, 6, 9, 10, 13, 14, 17, 18, 21, 22, 25, 26, 33, 34, 37, 38, 41, 42, 45, 46, 49, 50, 57, 58, 61, 62, 65, 66, 69, 70, 73, 74, 81, 82, 85, 86, 89, 90, 93, 94, 97, 98, 105, 106, 109, 110, 113, 114, 117, 118, 121, 122, 129, 130, 133, 134, 137, 138, 141, 142, 145, 146, 153, 154, 157, 158, 161, 162, 165, 166, 169, 170, 173, 174, 177, 178, 181, 182, 185, 186, 189, 190]

# for b in range(2,8):
#     file_list = os.listdir('Z:/share/대용량/2. 2020년 AI기반 스마트하우징 기술개발 사업 (국토교통부)/3차년도/개발자료/FDS data/시나리오 데이터/H' + str(b) + '/R' + str(1).zfill(2) + '/P' + str(1).zfill(3))
#     for c in range(1,11):
#         for d in range(1,4):
#             for a in range(0,65):
#                 data = pd.read_csv('Z:/share/대용량/2. 2020년 AI기반 스마트하우징 기술개발 사업 (국토교통부)/3차년도/개발자료/FDS data/시나리오 데이터/H' + str(b) + '/R' + str(c).zfill(2) + '/P' + str(d).zfill(3) + '/' + file_list[a] + '/H' + str(b) + '-R' + str(c).zfill(2) + '-P' + str(d).zfill(3) + '-' + file_list[a] + '_devices.csv',usecols=listex)
#                 print(data.shape)
#                 data.to_csv("Z:/share/대용량/2. 2020년 AI기반 스마트하우징 기술개발 사업 (국토교통부)/3차년도/개발자료/FDS data/시나리오 데이터/test/M" + str(num).zfill(5) + ".csv")
#                 print("M" + str(num) + "-end")
#                 num = num + 1
#                 print("---------------------------------------")

print("all end")

